[
    {
        "name": "VIVO Standing Bolt through Adjustable STAND V002F",
        "url": "https://www.amazon.com/VIVO-Standing-Bolt-through-Adjustable-STAND-V002F/dp/B00C5H5DN0/ref=sr_1_1?crid=1J58XA0BT6U75&dib=eyJ2IjoiMSJ9.QpAgRk11zorGW8QvPdoXGlQAU0VBUBJNWxOWMXq41pfrQL_vLAk99Jar4bL2zPuNGXex8DDnGVgZInRaFbyiIARmeutgli_lgIOs6dO8D2fQnQLF8BLyZB3lddy6kZHe2poqzIhVlfguY2EUnugNI8e8kM3nGWLKbErhgMb1oegvgJ86wegXon7btrPRUmKsp46G1EOmvX6DuJQyZRaCY03ddYYDw4U8LFksq-HIf2PotAYMnP-ThOa47-Nez3y-YZ-ji1aH8ARvdvP_GTYbLp5pBSJFwNRnHtSB74Raoi8.kl8_zzFCEBPbkIxeefjJZG6BhI8CE_3VhK0huMiz0dA&dib_tag=se&keywords=vivo&qid=1718527671&sprefix=vivo%2Caps%2C294&sr=8-1",
        "price": "$39.99",
        "content": [
            "Easy to assemble.  Supports 22\" monitors well, and base is solid.  Happy with purchase after going through other options.  Keep monitors within range and it works well.  As with any stand if they are unbalanced stand can wobble.  Would purchase again. Read more",
            "As someone who works remotely, finding the right equipment to make my workspace functional and comfortable is crucial. This duel stand that has proven to be an excellent addition to my setup. It not only provides durability and sturdiness, but also allows for easy setup, which is a major plus when you're working from home. This stand has truly made a difference in my productivity and overall work experience, and I would highly recommend it to anyone looking for a reliable and functional workspace solution. Read more",
            "VIVO Dual LCD Monitor Free-Standing Desk Mount w/ Optional Bolt-Through / Stand Heavy Duty Fully Adjustable Fits 2 Screens up To 27\" (STAND-V002F) My desk had a hole on the back for wires, etc. so I mounted it there and did not use the stand that came with the monitor. Installation was a snap, with what I considered to be a very nice instruction booklet. The booklet is printed on very nice glossy paper and is in English only, making it very easy to follow directions. Users who do not read English will have to get some help. All parts, screws, etc. were individually sealed in plastic bags, making it easy to sort them out for assembly. Nice job on this, VIVO. Now, two things that I figured out: Thing #1, after using the adjustment screw to raise the right monitor so that it was level with the left monitor (I had to raise it up as far as it would go, but it was enough), the right monitor became very wobbly on the VESA plate. There was a lot of slack once it was raised up. VIVO eagerly sent me another VESA plate, but this did nothing to fix the wobbling. I did find a solution, however, that was pretty easy. After raising the monitor up to the level of the other monitor with the adjustment screw, and before installing the cap nut, I got out the soldering gun and dripped solder down the area where the screw comes up through the plate. This filled up the gap in the hole and after putting the cap nut back on, the monitor is now as stable as the one that was not raised. The hole is oversized in order to make it easier to set the monitor on the stand, but it makes it wobble when raised up. I think the problem is that the cap nut 'bottoms out\" on the screw before it can tighten things up. If VIVO would supply a regular nut instead of the cap nut, or a deeper cap nut, to use on the screw, this would likely eliminate this problem. If the monitor doesn't need to be raised, the cap nut secures the VESA plate nicely to the arm so that it doesn't wobble. I didn't feel like going out an getting the right size nut, so I just dripped solder in there. I proper nut would be much better. Now, I'm not an engineer of any sort, so this may all be way off base, but if you find your monitor wobbling after you raise it to match the other, you might want to look first at the cap nut which locks the VESA plate to the stand. That is what locks the monitor down and prevents wobbling. It's not there only to keep the monitor from accidentally coming off the stand. it also locks the VESA plate securely to the stand. Had I not had to work out the wobbling issue, this would definitely be a Five Star stand. Thing #2,  The stand comes with all of the joint tension adjustments set very tight. After loosening up all of them, the stand became much more useful for me. I can now grab a monitor by it's bottom frame and drag it where I need it to be without struggling with it. The hinges are VERY loose now, but still secure. They don't wobble at all. If you plan to leave the monitors in place after you get set up, the tension is set pretty well. If you plan to move the monitors around like I do, you should consider releasing a LOT of the tension on the joints. Moving the monitor up close for photo editing has been a great benefit that I had not considered when I bought this stand. I though I was getting it just to have more room to clutter up my desk! Also, the stand comes with the three Allen wrenches needed to set up and adjust the stand. On the wire guide they put a place to store the three Allen wrenches. I thought that was a great idea. Read more",
            "Full disclosure: I ended up taking this back, but it was totally a case of \"It's not you, it's me.\" This stand is FANTASTIC and you should totally buy it. The reason I got it originally was because I found a 32\" smart TV locally that I couldn't pass up; at the time I had a 24\" TV and a 20\" monitor, so I decided to try doing the 32\" TV as a regular TV with my 24\" TV as a \"monitor\" for my computer. My vision isn't the greatest, so the 24\" TV wasn't doing great for me as a monitor, and the 20\" monitor I have (an older Acer) doesn't have a VESA mount. So it was either buy a different monitor, or get a different stand, and I opted to go back to my old setup for my monitor but buy a VIVO Single Monitor stand for my 32\" TV. Back to this stand's information: They give you all the parts you need, and although there are several steps and different types of screws & wrenches involved, I was able to put things together without much trouble. My only complaint is that I wish they had arranged things in the bags better during packaging so I didn't have to figure out what size screws and Allen wrenches things went to. Other than that, once I figured out what size of things went to what, it was totally fine thanks to their instructions. I loved being able to adjust the tightness of the arms and tilt angles, etc with the Allen wrenches; very awesome, and I wish the VIVO single monitor stand was that way instead of using an actual wrench with a nut/bolt situation. Once I got the TVs situated the way I wanted to, everything was steady with no danger of tipping over. I would totally trust this for the setup I had again if I had the right monitor to match the VESA mount. All that to say, this is an awesome monitor stand, and you should totally get this if you're looking into a dual-monitor setup that meets the size & weight requirements for your monitors. Thanks for reading! Read more",
            "Great value. no complaints. Read more",
            "Easy assembly and sturdy Read more",
            "I have used this particular model for a couple years now.  I like how they have not changed the design willy-nilly over time - price has been reasonable and stable over that time as well.  I prefer this simpler design over the pneumatic ones since they are easier to align and keep steady.  The stand is large enough to prevent tipping of the displays and is a good option to avoid drilling unnecessary holes in a desk. Read more",
            "I love that it is sturdy, and that it frees up space on my des so that I can set up my lap top after work Read more",
            "Excelente producto fail de instalar ahorra mucho espacio y me permitió poner uno de mis monitores en vertical Read more",
            "I have two 21\" inch screen, this stand holds them perfectly. It is very easy to assemble. The extra desk space the stand creates is extremely useful, plus my cats adore the extra space it creates (even though they still prefer my mousepad as a bed). It does feel like it can easily be tipped over forward, but maybe that's just me being paranoid of breaking two expensive screens. Read more",
            "works perfect if you have the monitors flat it stable but if you angle the monitors the stands fall down. its basic physics. the stand is perfect when you add weight to it to ensure it doesnt fall when you angle toe monitors to far forward. Read more"
        ]
    }
]