[
    {
        "name": "Apple iPhone 15 512GB Yellow",
        "url": "https://www.amazon.com/Apple-iPhone-15-512GB-Yellow/dp/B0CMPM9K7S/ref=sr_1_1?crid=E2Q6ZS5ELNEK&dib=eyJ2IjoiMSJ9.sSJmHW8At6YSThGGbzftOQnk1jePJwuuZ2jE54Ga3V-_9bxy-GLtRWNnGlQZb6Za-2F5bXzzyHYVfuhhNEyyQoNK-22KBfJsInANr5WN6d54iPQeRV2oMHfsZzSxrKXnvvbczRJOKGF3GfmJ7Mo6OSNr7ZQnrX8NSa4y0r-j5KBg5DLb65dvUZ47lez8Bj_1Pqjovk0c68rToYo7CxmCQXvn-_K9M9Le01UgHhP0P1o.FexMVIRvKoF0FpvB5tUAAZKLWBptYnlKEsf6ITl3vSw&dib_tag=se&keywords=iphone+15&qid=1718533484&sprefix=iphone+15%2Caps%2C398&sr=8-1",
        "price": "$748.00",
        "content": [
            "Seems great! No issues, and perfect battery health at 100%. Came right on time and no complaints. Perfect and seems new. Love it! Thank you Read more",
            "There is a TikTok creator that buys phones off of Amazon and at first I thought it was going to be very sketchy, but the phone was absolutely perfect! It said that it was in used excellent condition, but it was basically a brand new phone. I could not find any defects whatsoever and basically got a heck of a great deal for a brand new iPhone. Huge value for the money and excellent quality Read more",
            "This is a refurbished iPhone 15 at a very good price. Have had it for over a month now and works like new. Excellent battery life (the reason I gave up on my iPhone X).  The eSIM mad it pretty straightforward to activate on Mint Mobile. Read more",
            "This is basically a brand new iPhone being sold as Renewed. Well worth the money. Read more",
            "Phone looks new and was easy to transfer (Metro PCS). There is a youtube video that shows you the esim transfer so you can do it yourself. Phone is practically new and looks new. Everything worked as it should. Thanks for the $300 savings! Read more",
            "My hesitation to buy this IPhone from Amazon’s renewed program was  unwarranted. The phone arrived in excellent condition. The battery charged to 100%, showed 6 cycles and there were no bumps, bruises or knots that indicated hard use or wear and tear—just a barely noticeable nick on the screen. . Transferring data from my 11Pro to the 15 was fast and easy. The only challenge I experienced was installing the ESim card and my carrier helped with that.  So far, I haven’t experienced problems with the applications I use most often.  My tablet and watch connected easily and I have twice the capacity of my old phone. After reading about the renew program, I felt much safer than going through other Marketplaces where there is no guarantee for the product you purchase.Winning! Read more",
            "Upon receiving my product, it came with two small scratches on the screen. It Doesn't look like its impeding anything, so i would say this was a score. It came in fast, and overall, its cheaper than buying new. I would purchase this way again. Read more",
            "Only had for less than a week. No scratches or dents. Looks new. Battery was 100% and 1 cycle. Did have to take it to Verizon because of the eSIM. Which is fine. Sound, camera, and display are great. Very happy so far.  Will update if something comes up further in Read more"
        ]
    }
]